In [2]:
import pandas as pd
import numpy as np
arr={1:"a",2:"b",3:"c"}
s1=pd.Series(arr)
print(s1)

1    a
2    b
3    c
dtype: object

In [7]:
s=pd.Series()
s

C:\Users\NEERAJA\AppData\Local\Temp\ipykernel_9776\521516865.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s=pd.Series()

Series([], dtype: float64)

In [23]:
s1.loc[3]

'c'

In [24]:
s1.loc[[1,2]]

1    a
2    b
dtype: object

In [26]:
s=pd.Series(np.arange(10,20,1))
s

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

In [27]:
s.head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [28]:
s.tail(2)

8    18
9    19
dtype: int32

In [29]:
s.tail()

5    15
6    16
7    17
8    18
9    19
dtype: int32

In [30]:
s.count()

10

In [31]:
s=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [32]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [33]:
s.array

<PandasArray>
[1, 2, 3, 4, 5]
Length: 5, dtype: int64

In [34]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [35]:
s.dtype

dtype('int64')

In [37]:
s.shape

(5,)

In [39]:
s.ndim

1

In [40]:
s.nbytes

40

In [44]:
a=pd.Series([1,2,3,4])
b=pd.Series([5,6,7,8])
print(a)
print(b)

0    1
1    2
2    3
3    4
dtype: int64
0    5
1    6
2    7
3    8
dtype: int64

In [45]:
c=a.add(b)
c

0     6
1     8
2    10
3    12
dtype: int64

In [46]:
a.subtract(b)

0   -4
1   -4
2   -4
3   -4
dtype: int64

a.multipy(b)

In [47]:
a.multiply(b)

0     5
1    12
2    21
3    32
dtype: int64

In [49]:
a.mod(b)

0    1
1    2
2    3
3    4
dtype: int64

In [48]:
a.divide(b)

0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

In [50]:
a.pow(b)

0        1
1       64
2     2187
3    65536
dtype: int64

In [55]:
import pandas as pd
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [57]:
a=np.array([10,20,30])
b=np.array([40,50,60])
c=np.array([70,80,90])
df=pd.DataFrame(a)
df

    0
0  10
1  20
2  30

In [58]:
df1=pd.DataFrame([a,b,c],columns=["A","B","C"])
df1

    A   B   C
0  10  20  30
1  40  50  60
2  70  80  90

In [60]:
a=[{"a":10,"b":2},{"c":3,"d":4,"e":5}]
b=pd.DataFrame(a)
b

      a    b    c    d    e
0  10.0  2.0  NaN  NaN  NaN
1   NaN  NaN  3.0  4.0  5.0

In [62]:
d={"Name":["lakshmi","Neeraja","Keerthi"],"Rollno":[1,2,3],"English":[99,100,80],"DAA":[88,85,90]}
df=pd.DataFrame(d)
df

      Name  Rollno  English  DAA
0  lakshmi       1       99   88
1  Neeraja       2      100   85
2  Keerthi       3       80   90

In [64]:
df.index=[5,6,7]
df

      Name  Rollno  English  DAA
5  lakshmi       1       99   88
6  Neeraja       2      100   85
7  Keerthi       3       80   90

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 5 to 7
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     3 non-null      object
 1   Rollno   3 non-null      int64
 2   English  3 non-null      int64
 3   DAA      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 120.0+ bytes

In [80]:
df.describe()

       Rollno     English        DAA
count     3.0    3.000000   3.000000
mean      2.0   93.000000  87.666667
std       1.0   11.269428   2.516611
min       1.0   80.000000  85.000000
25%       1.5   89.500000  86.500000
50%       2.0   99.000000  88.000000
75%       2.5   99.500000  89.000000
max       3.0  100.000000  90.000000

In [82]:
df.size

12

In [83]:
df.shape

(3, 4)